//
//  AdvancedQuestion.m
//  QuickExampleOC
//
//  Created by ingo on 2021/5/7.
//

#import <Foundation/Foundation.h>

#pragma mark - 深入理解
/**
 1. 了解业内性能优化是怎么做的么
 7. 什么是虚拟内存，虚拟内存和物理内存的关系和区别
 7. 怎么监听页面的卡顿
 8. 怎么监听函数执行时间
 
 2. 你项目中是怎么做性能优化的
 1. 需求中的难点，你是怎么解决的
 9. 项目相关，用了什么技术，有哪些难点，怎么处理的
 
 
 1. QA发现了一个按钮无法响应点击事件，可能是什么原因导致的（说了五种情况好像没有答到面试官要的点）
 1. 项目中遇到的问题，怎么解决的
 
 14. AFN中 success 和 fail block是在子线程还是主线程
 16. SDWebImage的下载原理
 17. 如果有两个相同的url，SDWebImage是怎么处理的
 
 5. 代码题：ABCDE五个任务，D依赖AB的执行，E依赖BC的执行，怎么设计
 
 10. 怎么监测app卡顿
 
 7. 自己实现一个函数，其中有个形参是block，这个block是什么时候进行copy的，一定会进行copy操作嘛
 
 3. 怎么设计一个crash日志回捞系统
 4. Objc为啥要设计消息发送机制，直接调函数不好吗
 5. 怎么获取函数的堆栈
 6. 怎么监控APP卡顿
 7. APP启动做了哪些事情怎么优化
 9. 怎么进行业务解耦
 10. APP性能优化相关
 11. 设计一个下载任务
 12. 可以并行也可以串行
 13. 有最大的并发数量
 14. 可以断点续传
 15. 如何解耦
 16. 缓存怎么设计（说了LRU、LFU）
 
 3. 怎么设计一个crash日志回捞系统
 4. Objc为啥要设计消息发送机制，直接调函数不好吗
 5. 怎么获取函数的堆栈
 6. 怎么监控APP卡顿
 7. APP启动做了哪些事情怎么优化
 
 9. 怎么进行业务解耦
 10. APP性能优化相关
 11. 设计一个下载任务
 12. 可以并行也可以串行
 13. 有最大的并发数量
 14. 可以断点续传
 15. 如何解耦
 16. 缓存怎么设计（说了LRU、LFU）
 
 继续问项目，为啥要做这些东西，碰到了什么难点
 你觉得你的优势和缺点是啥
 自己的未来规划
 还有什么想问的么
 
 什么是虚拟内存，虚拟内存和物理内存的关系和区别
 
 9. C依赖AB任务执行完才能执行，你怎么设计

 13. 同时最多执行5个任务怎么设计

 5. autoreleasePool的底层数据结构，为什么要这么设计
 
 */
